In [21]:
# importing libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [22]:
#loading the dataset
food = pd.read_csv('food_prices_ken.csv')

In [23]:
# displaying basic information about the dataset
print(food.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18579 entries, 0 to 18578
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       18579 non-null  object
 1   admin1     18579 non-null  object
 2   admin2     18579 non-null  object
 3   market     18579 non-null  object
 4   latitude   18579 non-null  object
 5   longitude  18579 non-null  object
 6   category   18579 non-null  object
 7   commodity  18579 non-null  object
 8   unit       18579 non-null  object
 9   priceflag  18579 non-null  object
 10  pricetype  18579 non-null  object
 11  currency   18579 non-null  object
 12  price      18579 non-null  object
 13  usdprice   18579 non-null  object
dtypes: object(14)
memory usage: 2.0+ MB
None

In [24]:
#displaying the first few rows of the dataset.
print(food.head())

         date      admin1      admin2            market  latitude  longitude  \
0       #date  #adm1+name  #adm2+name  #loc+market+name  #geo+lat   #geo+lon
1  2006-01-15       Coast     Mombasa           Mombasa     -4.05  39.666667
2  2006-01-15       Coast     Mombasa           Mombasa     -4.05  39.666667
3  2006-01-15       Coast     Mombasa           Mombasa     -4.05  39.666667
4  2006-01-15       Coast     Mombasa           Mombasa     -4.05  39.666667

             category      commodity        unit         priceflag  \
0          #item+type     #item+name  #item+unit  #item+price+flag
1  cereals and tubers          Maize          KG            actual
2  cereals and tubers  Maize (white)       90 KG            actual
3     pulses and nuts          Beans          KG            actual
4     pulses and nuts    Beans (dry)       90 KG            actual

          pricetype   currency   price    usdprice
0  #item+price+type  #currency  #value  #value+usd
1         Wholesale        KES   16.13      0.2235
2         Wholesale        KES  1480.0     20.5041
3         Wholesale        KES   33.63      0.4659
4         Wholesale        KES  3246.0     44.9705

In [25]:
#data cleaning
# handling missing values if any
food.dropna(inplace=True)

In [26]:
#describing statistics 
# summary statistics for numeric values
food.describe()

,date,admin1,admin2,market,latitude,longitude,category,commodity,unit,priceflag,pricetype,currency,price,usdprice
count,18579,18579,18579,18579,18579,18579,18579,18579,18579,18579,18579,18579,18579,18579
unique,219,8,23,63,63,63,9,48,15,4,3,2,6987,11430
top,2021-04-15,Rift Valley,Nairobi,Nairobi,-1.283333,36.816667,cereals and tubers,Maize (white),KG,actual,Wholesale,KES,0.0,0.0
freq,623,7261,3835,1849,1849,1849,8695,1869,7440,10773,10310,18578,2687,2687

In [ ]:
#